In [1]:
import pandas as pd

In [2]:
dict1 = {
    "names": ["Zainab","priyanka","sanika","taliya"],
    "city": ["Ankara","India","Paris","Malaysia"],
    "no.": [1,2,3,4]
}

In [16]:
df = pd.DataFrame(dict1)

In [4]:
df

      names      city  no.
0    Zainab    Ankara    1
1  priyanka     India    2
2    sanika     Paris    3
3    taliya  Malaysia    4

In [5]:
df.to_csv('fri.csv',index= False)

In [6]:
df.head(2)

      names    city  no.
0    Zainab  Ankara    1
1  priyanka   India    2

In [7]:
df.describe()

            no.
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

In [8]:
data = pd.read_csv('re.csv')

In [9]:
data

      names      city  no.   color
0    Zainab    Ankara    1   green
1  priyanka     India    2  yellow
2    sanika     Paris    3    pink
3    taliya  Malaysia    4   black

In [10]:
data['names']

0      Zainab
1    priyanka
2      sanika
3      taliya
Name: names, dtype: object

In [11]:
data['color'][2] = "azzure"

C:\Users\shaik\AppData\Local\Temp\ipykernel_10496\1864919297.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  data['color'][2] = "azzure"
C:\Users\shaik\AppData\Local\Temp\ipykernel_10496\1864919297.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['color'][2] = "azzure"

In [12]:
data

      names      city  no.   color
0    Zainab    Ankara    1   green
1  priyanka     India    2  yellow
2    sanika     Paris    3  azzure
3    taliya  Malaysia    4   black

In [13]:
data.to_csv("read.csv",index=True)

In [14]:
data.index = ["one","two","three","four"]

In [15]:
data

          names      city  no.   color
one      Zainab    Ankara    1   green
two    priyanka     India    2  yellow
three    sanika     Paris    3  azzure
four     taliya  Malaysia    4   black